&НаСервере
Перем мОбработкаОбъект;
&НаКлиенте
Перем ОсновнаяФорма;

//{		Сервисные методы

// Заглушка для совместимости с управляемыми формами	
&НаСервере
Функция ОбработкаОбъект()
	
	Если мОбработкаОбъект=Неопределено Тогда
		
		Если Не ЭтоУправляемаяФорма() Тогда
			мОбработкаОбъект = Вычислить("ОбработкаОбъект");
		Иначе
			мОбработкаОбъект = Вычислить("РеквизитФормыВЗначение(""Объект"")");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат мОбработкаОбъект;
	
КонецФункции
	
&НаКлиенте
Функция ОсновнаяФорма() Экспорт

	Если ОсновнаяФорма = Неопределено Тогда
		ОсновнаяФорма= ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;	
	
	Возврат ОсновнаяФорма;
	
КонецФункции

&НаСервере
Функция ЭтоУправляемаяФорма()
	
	Возврат (СтрДлина(ТипЗнч(ЭтаФорма))>5);
	
КонецФункции

//}		Сервисные методы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьСписокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	ТекСтрока = Элементы.СправочникСписок.ТекущаяСтрока;
	ТекущаяСсылка = Неопределено;
	Если Не ТекСтрока=Неопределено Тогда
		ТекущаяСсылка = СправочникСписок.НайтиПоИдентификатору(ТекСтрока).Ссылка;
	КонецЕсли;
	
	Список = ОбработкаОбъект().ЭДО_СправочникМенеджер_ПолучитьСписокЭлементов("Организации");
	
	СправочникСписок.Очистить();
	
	Для Каждого Стр Из Список Цикл
		НоваяСтрока = СправочникСписок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
	КонецЦикла;
	
	Если НЕ ТекущаяСсылка=Неопределено Тогда
		СтрокиПоОтбору = СправочникСписок.НайтиСтроки(Новый Структура("Ссылка",ТекущаяСсылка));
		Если СтрокиПоОтбору.Количество()=1 Тогда
			Элементы.СправочникСписок.ТекущаяСтрока = СтрокиПоОтбору[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьССервером(Команда)
	
	ОписаниеОповещения = ОсновнаяФорма().НовыйОписаниеОповещения("СинхронизироватьЮрФизЛицаССервером",ОсновнаяФорма().Модуль_РаботаСКомпонентой());
	ОсновнаяФорма().ВыполнитьДействиеПослеАвторизации(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлемент(Команда)
	ОткрытьФормуЭлементаДляРедактированияИлиДобавления(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СправочникСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Параметры.ФормаОткрытаКакВыбор Тогда
		Если НЕ Элементы.СправочникСписок.ТекущиеДанные=Неопределено Тогда
			ЭтаФорма.Закрыть(Элементы.СправочникСписок.ТекущиеДанные.Ссылка);
		КонецЕсли;
	Иначе
		ОткрытьФормуЭлементаДляРедактированияИлиДобавления(Ложь);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЭлементаДляРедактированияИлиДобавления(ЭтоДобавление=Ложь)
	
	ТекСтрока = Элементы.СправочникСписок.ТекущиеДанные;
	
	Если (ТекСтрока=Неопределено) и Не ЭтоДобавление Тогда
		Возврат;
	КонецЕсли;	
	
	СсылкаНаЭлемент = Неопределено;
	
	Если НЕ ТекСтрока=Неопределено 
		И НЕ ЭтоДобавление Тогда
		
		СсылкаНаЭлемент = ТекСтрока.Ссылка;
		
	КонецЕсли;
	
	ПараметрыФормы=	Новый Структура;
	ПараметрыФормы.Вставить("Ссылка",							СсылкаНаЭлемент);
	ПараметрыФормы.Вставить("Новая",							ЗначениеЗаполнено(СсылкаНаЭлемент));
	ПараметрыФормы.Вставить("ИмяСправочника",					"Организации");
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца",	Истина);
	
	ОткрытьФорму(ОсновнаяФорма().Модуль_Платформа().ПутьКФормам+"Организации_ФормаЭлементаУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="Диадок_Сохранение_Организация" Тогда
		ОбновитьСписокНаСервере();
	КонецЕсли;
	
КонецПроцедуры

