
////////////////////////////////////////////////////////////////////////////////
// API для работы с формой

&НаКлиенте
Процедура фОткрытьФорму() Экспорт 
	
	Если Открыта() Тогда
		Активизировать();
	Иначе
		Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура фЗакрытьФорму() Экспорт 
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовок(Знач стрЗаголовок) Экспорт 
	
	Заголовок = стрЗаголовок;
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМаксимальноеЗначение(Знач чМаксимальноеЗначение) Экспорт 
	
	Элементы.ИндикаторПрогресса.МаксимальноеЗначение = чМаксимальноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПрогресса(Знач чЗначение) Экспорт 
	
	ТекущееЗначениеПрогресса = чЗначение;
	фОткрытьФорму();
	ОбновитьОтображениеДанных();
		
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьЗначениеПрогресса(Знач чЗначение = 1) Экспорт 
	
	Если МассоваяОбработка Тогда
		ТекущееЗначениеПрогресса = ТекущееЗначениеПрогресса + чЗначение;
		фОткрытьФорму();
		ОбновитьОтображениеДанных();
	КонецЕсли;
		
КонецПроцедуры

Функция ПрогрессВыполнен() Экспорт 
	
	Возврат (ТекущееЗначениеПрогресса = Элементы.ИндикаторПрогресса.МаксимальноеЗначение)
			или (РазмерОчередиПодготовленныхПакетов = 0 и РазмерОчередиОтправленныхПакетов = 0);  
			// костыль на подписание входящих - та неправильно отрабатывает счетчик по документам, ответы на которые еще не готовы или уже отправлены
	
КонецФункции

// API для работы с формой
////////////////////////////////////////////////////////////////////////////////


&НаКлиенте
Процедура УстановитьНадписиПриОтправкеПакетов(парРазмерОчередиПодготовленныхПакетов, парРазмерОчередиОтправленныхПакетов) Экспорт
	
	//ЭтаФорма.Заголовок = "Обработано пакетов для отправки: "+ТекущееЗначениеПрогресса+" из "+Элементы.ИндикаторПрогресса.МаксимальноеЗначение;
	РазмерОчередиПодготовленныхПакетов	= парРазмерОчередиПодготовленныхПакетов;
	РазмерОчередиОтправленныхПакетов	= парРазмерОчередиОтправленныхПакетов;
	
	Элементы.НадписьКомментарий1.Заголовок = "Очередь подготовленных пакетов: " + РазмерОчередиПодготовленныхПакетов;
	Элементы.НадписьКомментарий2.Заголовок = "Очередь отправленных пакетов: " + РазмерОчередиОтправленныхПакетов;	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассоваяОбработка = Ложь;
	
КонецПроцедуры

