&НаСервере
Перем ОбработкаОбъект;

&Наклиенте
Перем ОсновнаяФорма;

//{		Сервисные методы
	
&НаСервере
Функция ОбработкаОбъект()

	Если ОбработкаОбъект=Неопределено Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;	
	
	Возврат ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт

	Если ОсновнаяФорма = Неопределено Тогда
		ОсновнаяФорма= ВладелецФормы.ОсновнаяФорма();
	КонецЕсли;	
	
	Возврат ОсновнаяФорма;
	
КонецФункции

//}		Сервисные методы

&НаКлиенте
// Объединение функций в формах списков
// Здесь не будет обработчика "ПослеРедактирования", вместо них будут оповещения в самих формах элементов
Процедура ОткрытьФормуЭлементаДляРедактированияИлиДобавления(мИмяФормы, СсылкаНаЭлемент=Неопределено, ИмяСправочника = Неопределено) Экспорт //здесь достаточно одного параметра
	
	ПараметрыФормы=	Новый Структура;
	ПараметрыФормы.Вставить("Ссылка",							СсылкаНаЭлемент);
	ПараметрыФормы.Вставить("Новая",							ЗначениеЗаполнено(СсылкаНаЭлемент));
	ПараметрыФормы.Вставить("ИмяСправочника",					ИмяСправочника);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца",	Истина);
	
	ОткрытьФорму(ПутьКФормам+мИмяФормы, ПараметрыФормы); // модальность не нужна
	
	//Если ОсновнаяФорма().Параметры.МодальностьЗапрещена Тогда
	//	
	//	_ОткрытьФормуОбъектаМодально(ПутьКФормам+мИмяФормы, ПараметрыФормы);
	//	
	//Иначе
	//	
	//	ФормаЭлемента = ОсновнаяФорма().ПолучитьФормуОбработки(мИмяФормы,ПараметрыФормы);
	//	
	//	ФормаЭлемента.СсылкаНаЭлемент = СсылкаНаЭлемент;
	//	ФормаЭлемента.ОткрытьМодально();
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.МодальностьЗапрещена=ОбработкаОбъект().МодальностьЗапрещена();
	ПутьКФормам = ОбработкаОбъект().Метаданные().ПолноеИмя() + ".Форма.";
	
КонецПроцедуры

&НаКлиенте
Процедура _ОткрытьФормуОбъектаМодально(ИмяФормы, ПараметрыФормы = Неопределено, ОписаниеОбработчика = Неопределено, РежимБлокирования = Неопределено)

	Если РежимБлокирования = Неопределено Тогда
		РежимБлокирования = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	Если ПараметрыФормы <> Неопределено И ПараметрыФормы.Свойство("Ссылка") Тогда
		ВладелецОбработчика = ПараметрыФормы.Ссылка;
	Иначе
		ВладелецОбработчика = Неопределено;
	КонецЕсли;
		
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца",	Истина);
	
	Выполнить("ОткрытьФорму(ИмяФормы, ПараметрыФормы, ВладелецОбработчика, , , ,  ОписаниеОбработчика, РежимБлокирования)");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеПереопределенная(Парам1, Текст=Неопределено, Таймаут=0, Заголовок="") Экспорт
	
	Если Параметры.МодальностьЗапрещена Тогда
		
		Выполнить("
			|ПоказатьПредупреждение(Парам1, Текст, Таймаут, Заголовок);
			|");
		
	Иначе
		
		Выполнить("Предупреждение(Текст,Таймаут)");
		
	КонецЕсли;
	
КонецПроцедуры
