
&НаКлиенте
Перем ОсновнаяФорма;

&НаКлиенте
Функция ОсновнаяФорма()

	Если ОсновнаяФорма=Неопределено Тогда
		ОсновнаяФорма = ВладелецФормы;
	КонецЕсли;	
	
	Возврат ОсновнаяФорма;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Текст = "Необходимо обновить конфигурацию базы данных из файла. Это может сделать сотрудник, занимающийся сопровождением базы (как правило, программист 1С).
	|
	|Файл для обновления базы будет сохранен на диск.";
	
	Если НЕ Параметры.ПредложитьИспользование1СЭДО Тогда
		Элементы.ИспользоватьПодсистему1СЭДО.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКонфигурациюВФайл(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок		= "Укажите файл, в который нужно сохранить обновление для вашей конфигурации";
	ДиалогВыбора.Фильтр			= "Файл конфигурации 1С (*.cf)|*.cf";      
	ДиалогВыбора.ПолноеИмяФайла = "Диадок_upd.cf";
	
	Если НЕ ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
		
	ПолучитьМакетДляОбновленияДляХраненияДанных().Записать(ПутьКФайлу);
	
	ОписаниеОповещения = ОсновнаяФорма().НовыйОписаниеОповещения("ОбработчикЗакрытияФормы", ЭтаФорма);
	мПоказатьПредупреждение(ОписаниеОповещения,
	"ВНИМАНИЕ! 
	|При обновлении конфигурации в окне ""Сравнение, объединение"" НЕ ЗАБУДЬТЕ снять флажок с раздела ""Свойства""!
	|Запустите модуль после обновления конфигурации базы из файла.");
			
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетДляОбновленияДляХраненияДанных()
		
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет("ОбновлениеДляХраненияДанных_cf");
	
КонецФункции

&НаКлиенте
Процедура ИспользоватьПодсистему1СЭДО(Команда)
	
	УстановитьЗначениеСвойстваИспользования1СЭДОНаСервере();
	
	мПоказатьПредупреждение(ОсновнаяФорма().НовыйОписаниеОповещения("ОбработчикЗакрытияФормы", ЭтаФорма), "Включено использование стандартной подсистемы 1С-ЭДО для хранения данных Диадок. Перезапустите модуль.");
		
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеСвойстваИспользования1СЭДОНаСервере()
	
	РеквизитФормыВЗначение("Объект").ЭДО_УстановитьЗначениеСвойства1СЭДО("Использовать1СЭДО", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ВладелецФормы.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура мПоказатьПредупреждение(Парам1, Текст=Неопределено, Таймаут=0, Заголовок="")
	
	ОсновнаяФорма().Модуль_Платформа().ПоказатьПредупреждениеПереопределенная(Парам1, Текст, Таймаут, Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормы(Параметры) Экспорт
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
